{
  "backend/main.mo": "Main Motoko actor implementing user profiles, contact form submissions, booking management with payment status tracking, Stripe configuration, and role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report documenting phone number (8136009930) and email (ajayyadavddm@gmail.com) updates across CTAButtons, Footer, and ContactPage components with associated test IDs and high confidence ratings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages (Home, Services, Booking, About, Contact, Payment), components (Layout, Footer, CTAButtons, SEO), hooks (booking, checkout, payment status), and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining design tokens for light/dark modes including background, foreground, primary, secondary, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with meta tags for Ajay Labour Service in Tinsukia & Doomdooma, mounting React app to #root div.",
  "frontend/src/App.tsx": "TanStack Router setup defining seven routes (home, services, booking, about, contact, payment-success, payment-failure) with Layout wrapper and intent-based preloading.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with validation for name, phone (10-digit), optional email, and message fields, submitting to backend with success confirmation display.",
  "frontend/src/components/CTAButtons.tsx": "Call-to-action buttons component with Call Now (tel:+918136009930), WhatsApp (918136009930 with optional pre-filled message), and Book Now navigation buttons.",
  "frontend/src/components/FAQSection.tsx": "Displays an accordion-style FAQ section with 8 common questions about booking, pricing, verification, service areas, and policies for the labour service.",
  "frontend/src/components/FeedbackBanner.tsx": "Shows a dismissible banner encouraging users to share feedback, with copy link and WhatsApp share buttons; uses localStorage to remember dismissal state.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with company info, quick links, contact details (phone, email, location), service areas, and social media icons.",
  "frontend/src/components/Layout.tsx": "Provides the main layout wrapper with sticky header navigation (desktop and mobile), logo, nav links, call-to-action button, and footer outlet for page content.",
  "frontend/src/components/ProjectGallery.tsx": "Displays a grid gallery of 6 completed project images with categories (mason, electrical, plumbing, painting, construction) and hover effects.",
  "frontend/src/components/SEOHead.tsx": "Dynamically updates document title and meta tags (description, keywords, Open Graph, Twitter) for SEO based on provided props.",
  "frontend/src/components/TestimonialsSection.tsx": "Shows a grid of 4 customer testimonials with profile images, 5-star ratings, names, and review text for social proof.",
  "frontend/src/components/TrustBadges.tsx": "Displays four trust badges (Verified Workers, Quick Response, Transparent Pricing, Customer Support) in a responsive grid layout with icons and descriptions.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance with Internet Identity authentication, creating anonymous or authenticated actors and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCreateBooking.ts": "React Query mutation hook for creating bookings by calling the backend actor's createBooking method with booking details.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "React Query mutation hook that creates a Stripe checkout session via the backend actor, parsing the JSON response to extract the session URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing identity state and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useSubmitContactForm.ts": "React Query mutation hook for submitting contact form data (name, phone, email, message) to the backend actor.",
  "frontend/src/hooks/useUpdateBookingPaymentStatus.ts": "React Query mutation hook that updates a booking's payment status and invalidates the bookings query cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a blue and orange color theme for Ajay Labour Service, including light and dark mode variants.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/AboutPage.tsx": "About page displaying company story, founder information, business journey timeline, and core values with SEO metadata for the labour service provider.",
  "frontend/src/pages/BookingPage.tsx": "Booking form page with validation that creates a booking, stores the ID in sessionStorage, initiates a Stripe checkout session for ₹300 advance fee, and includes WhatsApp booking option.",
  "frontend/src/pages/ContactPage.tsx": "Contact page displaying contact form, phone/email/location details, business hours, and service area information for Tinsukia and Doomdooma with SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring hero section, trust badges, services preview, project gallery, testimonials, FAQ section, and CTA buttons with SEO optimization for Tinsukia and Doomdooma labour services.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page displaying error message, troubleshooting steps, refund information, and links to retry booking or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success page that updates booking payment status via API, displays confirmation with booking ID, and shows next steps after successful payment.",
  "frontend/src/pages/ServicesPage.tsx": "Services listing page displaying detailed information for six labour categories (mason, electrician, plumber, painter, construction helper, daily wage labour) with features, experience levels, and timelines.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space (including Labour blue/orange brand colors), typography, container queries, animations, and responsive breakpoints for the project.",
  "project_state.json": "Project metadata tracking implemented features for Ajay Labour Service website including home page, booking system with ₹300 advance payment, trust elements, SEO optimization, testimonials, and mobile-responsive design with blue/orange theme."
}