{
  "backend/main.mo": "Main actor implementing super admin management, user profiles, bookings, contact submissions, service locations, Stripe integration, and role-based access control with comprehensive debug logging throughout authorization flows.",
  "backend/migration.mo": "Migration module defining OldActor and NewActor types with a run function that adds the superAdmin field (initialized to null) to the actor state during upgrades.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: AdminGuard component updates for super admin authentication flow and console logging additions for debugging the super admin configuration process.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including routing, authentication, booking flows, payment handling, admin dashboard, and various page components with detailed feature descriptions.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components including sidebar, charts, and semantic tokens.",
  "frontend/index.html": "HTML entry point with meta tags for SEO, viewport configuration, and root div for React application mounting.",
  "frontend/src/App.tsx": "TanStack Router setup defining all application routes (home, services, booking, about, contact, payment success/failure, admin) with Layout as root component and intent-based preloading.",
  "frontend/src/components/AdminGuard.tsx": "Authentication guard component that checks Internet Identity login status and admin permissions, displaying appropriate UI states (loading, login prompt, access denied, or admin content) with comprehensive console logging for debugging.",
  "frontend/src/components/BookingFilters.tsx": "Filter component for bookings with payment status, work type, and date range selectors. Includes a clear filters button and manages filter state through props.",
  "frontend/src/components/BookingMetrics.tsx": "Dashboard metrics component displaying total bookings, paid bookings, pending payments, and total revenue in card format. Fetches data using useGetBookingMetrics hook with loading states.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with name, phone, email, and message fields. Includes validation, submission handling via useSubmitContactForm hook, and success state display.",
  "frontend/src/components/CTAButtons.tsx": "Call-to-action buttons component with phone call, WhatsApp, and booking navigation options. Supports optional service type and location parameters for WhatsApp message pre-filling.",
  "frontend/src/components/FAQSection.tsx": "Accordion-based FAQ section displaying common questions about booking, pricing, service areas, worker verification, and policies.",
  "frontend/src/components/FeedbackBanner.tsx": "Dismissible banner prompting users to share feedback with copy link and WhatsApp share functionality. Uses localStorage to persist dismissal state.",
  "frontend/src/components/Footer.tsx": "Site footer with company info, quick links, contact details, service areas, and social media icons. Organized in a responsive grid layout.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, navigation, authentication controls (Internet Identity login/logout), and footer. Includes mobile menu, admin dashboard link for authorized users, and error handling for login failures.",
  "frontend/src/components/ProjectGallery.tsx": "Displays a grid gallery of six project categories (mason, electrical, plumbing, painting, construction, completed) with images and descriptions. Uses hover effects and gradient overlays.",
  "frontend/src/components/SEOHead.tsx": "SEO component that dynamically updates document title, meta description, keywords, Open Graph, and Twitter meta tags based on props. Runs side effects via useEffect.",
  "frontend/src/components/TestimonialsSection.tsx": "Renders a grid of four customer testimonials with avatars, star ratings, names, and review text. Styled with cards and hover effects.",
  "frontend/src/components/TrustBadges.tsx": "Displays four trust badges (Verified Workers, Quick Response, Transparent Pricing, Customer Support) in a responsive grid with icons and descriptions.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authenticated and anonymous modes. Invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useCreateBooking.ts": "React Query mutation hook for creating bookings via the backend actor. Includes detailed logging and error handling for booking creation.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "React Query mutation hook for creating Stripe checkout sessions with shopping items. Parses JSON response, validates session URL, and provides structured error types (UPI, Stripe, network, validation).",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching bookings, checking admin status, and retrieving booking metrics from the backend actor.",
  "frontend/src/hooks/useSubmitContactForm.ts": "React Query mutation hook for submitting contact form data (name, email, phone, message) to the backend actor.",
  "frontend/src/hooks/useUpdateBookingPaymentStatus.ts": "React Query mutation hook for updating booking payment status by ID and invalidating the bookings cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a blue and orange color theme for Ajay Labour Service, including light and dark mode variants.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with InternetIdentityProvider and QueryClientProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "About page component displaying founder story, business journey timeline, and company information for Ajay Labour Service with SEO optimization.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with booking metrics, filtering by payment status/work type/date range, and sortable table of all bookings protected by AdminGuard.",
  "frontend/src/pages/BookingPage.tsx": "Booking form page that validates user input, requires Internet Identity authentication, creates bookings via backend actor, and redirects to Stripe checkout for advance payment.",
  "frontend/src/pages/ContactPage.tsx": "Contact page component displaying contact form, phone/email/location details, business hours, and service area information for Tinsukia and Doomdooma with SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring hero section with CTAs, trust badges, services preview, testimonials, project gallery, FAQ section, and feedback banner with SEO optimization for labour services in Tinsukia and Doomdooma.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page displaying error message, common payment issues (UPI timeout, insufficient funds, network issues), troubleshooting tips, and retry/contact options with session cleanup.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success page that updates booking payment status via API hook, displays confirmation message with booking ID, payment method info, and next steps after successful Stripe payment.",
  "frontend/src/pages/ServicesPage.tsx": "Services listing page showcasing six labour categories (Mason, Electrician, Plumber, Painter, Construction Helper, Daily Wage Labour) with detailed descriptions, features, experience levels, and timelines for each service type.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata for Ajay Labour Service website tracking architectural decisions, known issues (booking failures, login errors, payment configuration), existing features (home page, booking form, payment integration), and super admin access control requirements."
}