{
  "backend/main.mo": "Main Motoko actor implementing user profile management, booking system with Stripe payment integration, role-based access control (super admin, admin, user roles), and HTTP outcall functionality for external API interactions.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: website rebranding from 'Ajay Labour Service' to 'Assam Labour Service', adding 'Daily Labour Service' to the services page, and ensuring homepage accessibility for the new service.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, and hooks, describing the 'Assam Labour Service' application with booking, payment, authentication, and admin dashboard functionality.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining design tokens for light and dark modes, including sidebar, chart, and semantic color variables.",
  "frontend/index.html": "HTML entry point with SEO metadata for 'Assam Labour Service' targeting Tinsukia & Doomdooma, loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for home, services, booking, about, contact, payment success/failure, and admin dashboard pages.",
  "frontend/src/components/AdminGuard.tsx": "Authentication and authorization guard component that checks Internet Identity login status and admin privileges, displaying appropriate UI states (loading, login prompt, access denied, or protected content).",
  "frontend/src/components/BookingFilters.tsx": "Filter component for bookings with payment status, work type, and date range selectors. Includes clear filters functionality and displays active filter state.",
  "frontend/src/components/BookingMetrics.tsx": "Dashboard metrics component displaying total bookings, paid bookings, pending payments, and total revenue in card format with loading states.",
  "frontend/src/components/ContactForm.tsx": "Contact form with validation for name, phone, email, and message fields. Shows success state after submission and handles form errors.",
  "frontend/src/components/CTAButtons.tsx": "Call-to-action buttons for phone, WhatsApp, and booking navigation with dynamic WhatsApp message generation based on service type and location.",
  "frontend/src/components/FAQSection.tsx": "Accordion-based FAQ section displaying 8 common questions about booking, pricing, verification, service areas, and policies.",
  "frontend/src/components/FeedbackBanner.tsx": "Dismissible banner with copy link and WhatsApp share functionality for collecting user feedback. Uses localStorage to persist dismissal state.",
  "frontend/src/components/Footer.tsx": "Site footer with company info, quick links, contact details, service areas, and social media icons organized in a responsive grid layout.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, authentication controls using Internet Identity, admin dashboard link for authorized users, and mobile menu support. Includes error handling for login failures and query cache management.",
  "frontend/src/components/ProjectGallery.tsx": "Displays a grid gallery of six project categories (mason, electrical, plumbing, painting, construction, completed) with images and descriptions, featuring hover effects and gradient overlays.",
  "frontend/src/components/SEOHead.tsx": "Dynamically updates document title and meta tags (description, keywords, Open Graph, Twitter) for SEO optimization based on provided props.",
  "frontend/src/components/TestimonialsSection.tsx": "Renders a grid of four customer testimonials with profile images, 5-star ratings, and review text for the labour service.",
  "frontend/src/components/TrustBadges.tsx": "Displays four trust badges (Verified Workers, Quick Response, Transparent Pricing, Customer Support) with icons and descriptions in a responsive grid layout.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, handling both anonymous and authenticated states, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useCreateBooking.ts": "React Query mutation hook for creating bookings by calling the backend actor's createBooking method with detailed logging and error handling.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "React Query mutation hook for creating Stripe checkout sessions with structured error handling for different failure types (UPI, Stripe, network, validation) and comprehensive logging.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity delegation, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching bookings, checking admin status, and retrieving booking metrics from the backend actor.",
  "frontend/src/hooks/useSubmitContactForm.ts": "React Query mutation hook for submitting contact form data (name, email, phone, message) to the backend actor.",
  "frontend/src/hooks/useUpdateBookingPaymentStatus.ts": "React Query mutation hook that updates a booking's payment status by ID and invalidates the bookings cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a blue and orange color theme for Ajay Labour Service, including light and dark mode variants.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "About page component displaying founder story, business journey timeline, and company values for Assam Labour Service with SEO optimization.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with booking metrics, filtering by payment status/work type/date range, and sortable table of all bookings protected by AdminGuard.",
  "frontend/src/pages/BookingPage.tsx": "Booking form page that collects customer details, creates a booking, initiates Stripe checkout session with UPI support, and handles authentication requirements.",
  "frontend/src/pages/ContactPage.tsx": "Contact page component displaying contact information (phone, email, service areas, hours) and a contact form with SEO metadata for Tinsukia and Doomdooma labour services.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring hero section, trust badges, services preview, testimonials, project gallery, FAQ section, and CTA buttons with SEO optimization for labour services in Tinsukia and Doomdooma.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page displaying error message, common payment issues (UPI timeout, insufficient funds, network issues), troubleshooting tips, and retry/contact options.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success page that updates booking payment status via API hook, displays confirmation message with booking reference ID, and provides next steps after successful Stripe payment.",
  "frontend/src/pages/ServicesPage.tsx": "Services listing page showcasing detailed information for each labour service (mason, electrician, plumber, painter, helpers) including features, experience levels, timelines, and trust badges.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, custom animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Project metadata tracking existing features (website name updates, daily labour service additions), pending feature requests, known build issues, and project configuration for 'Ajay Labour Service'."
}