{
  "kind": "build_request",
  "title": "Rename website and add daily labour service",
  "projectName": "Ajay Labour Service",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the website name from 'Ajay Labour Service' to a new name specified by the user. Update all occurrences in frontend files including SEO metadata, page titles, headers, footers, and About page content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "change the name of website"
        ]
      },
      "acceptanceCriteria": [
        "All visible references to the website name are updated consistently across all pages",
        "SEO metadata (title tags, meta descriptions) reflect the new name",
        "Footer, header, and About page display the new name",
        "No hardcoded references to the old name remain in user-facing content"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add 'Daily Labour Service' as a new service offering on the Services page. Include a dedicated section with service description, features, typical use cases, and worker qualifications similar to existing service categories (mason, electrician, plumber, painter, construction helper, daily wage labour).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "add daily labour sevice"
        ]
      },
      "acceptanceCriteria": [
        "A new 'Daily Labour Service' section appears on the Services page",
        "The section includes a clear description of what daily labour services entail",
        "Features and benefits are listed in a format consistent with other service categories",
        "The service is visually integrated with the existing services layout"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the 'Daily Labour Service' is accessible from the homepage services preview section and includes appropriate call-to-action buttons linking to the detailed service information.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-final"
        ],
        "quotes": [
          "add daily labour sevice"
        ]
      },
      "acceptanceCriteria": [
        "Daily Labour Service appears in the homepage services preview grid",
        "CTA buttons (Call Now, WhatsApp, Book Now) work correctly for the new service",
        "The service card maintains visual consistency with existing service cards"
      ]
    }
  ],
  "constraints": [
    "Do not modify backend code (previous build attempts failed when changing backend)",
    "Maintain existing color scheme and visual design unless new name requires branding updates",
    "Preserve all existing functionality including WhatsApp integration and contact forms",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui"
  ],
  "nonGoals": [
    "Changing the backend booking or payment logic",
    "Modifying the admin dashboard functionality",
    "Altering the color scheme or visual theme",
    "Adding new backend routes or API endpoints"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}